{
    "name": "Scenario 3: Up by the Bootstraps",
    "id": 3,
    "tutorial": "<b>Objective</b>: Pay off your entire debt before 12 months is up. <br>    <br>Welcome to level 3, the final part of the game!<br>       <br>In this level, your objective is to pay back your loan to get out of debt in 12 months. The initial amount of money you have is sadly not enough. Hence, to complete this challenge you need to invest and trade stocks.<br>        <br>Pay attention to the increase of your debt throughout time: as time goes on, the interest accumulates and your debt increases. Hence, the later you pay back, the more interest you will have to pay, and the harder it will be to get out of debt...<br>        <br>However, you do need to keep as much money as possible for investment - this is a tricky balance to achieve. A helpful tip: for any amount of money you choose to invest instead of paying back, try to make sure that its return on investment is larger than the corresponding increase in debt.",
    "initial_money": -5000,
    "stocks": [
        {
            "id": 0,
            "name": "Chyrpr Relaunched",
            "price": 250,
            "volatility": 4,
            "trend": -3.6,
            "change_in_trend": 0.2,
            "number_of_historical_prices": 22
        },
        {
            "id": 1,
            "name": "Pay per News",
            "price": 150,
            "volatility": 2,
            "trend": 1.8,
            "change_in_trend": -0.05,
            "number_of_historical_prices": 22
        },
        {
            "id": 2,
            "name": "Flighty Fashions",
            "price": 400,
            "volatility": 10,
            "trend": -0.16,
            "change_in_trend": 0.06,
            "number_of_historical_prices": 22
        }        
    ],
    "loan": {
        "exists": 1,
        "id": 0,
        "amount_if_taken": 20000,
        "offered_interest_rate": 1.2,
        "volatility": 1,
        "trend": 0,
        "change_in_trend": 0,
        "c_2_in_trend": 0,
        "number_of_historical_interest_rates": 22,
        "max_amount_multiplier": 3
    },
    "timestep": "Month",
    "timelimit": 12,
    "win_cond_type": "loan",
    "win_cond": "None",
    "win_message": "You have successfully crawled your way up from the pits of despair. <br> <br>Congratulations, by completing this final challenge, you have bested all we have to offer!",
    "lose_message": "You have succumbed to the depths of your debt. Perhaps you'd like to try again? <br><br>This is the final challenge we have to offer, the only other option is to restart the game entirely."
 }
 