{
    "name": "Scenario 1: Get Rich Quick!",
    "id": 1,
    "tutorial": "<b>Objective</b>: Increase your money to 11000 before 7 days is up <br>    <br>Welcome to level 1! <br>        <br>In this game, you can choose to buy or sell the stocks that are presented to you. You start with an initial amount of 10000 and can move forward through the game by clicking on the <b>Next Day</b> button in the top center of the screen.<br>     <br>Your net worth is the total value of all the assets you own minus your liabilities. In this level, it is the sum of your cash and the value of all the stocks you have bought. The prices of the stocks change over time.<br>    <br>You can access general information about stocks by clicking on the <b>i</b> buttons; graphs that display a stock's historical behavior are available by clicking on the corresponding <b>h</b> buttons.<br>        <br>You also possess the power to 'split' the world into two different timelines' by clicking on the <b>Split Timeline</b> button. The two created timelines start off the same but are independent from each other: you can make decisions in either timeline without affecting the other one. <br><br>When both of the timelines are active, you have the ability to 'merge' them by dropping the one you want to delete with the <b>Drop Timeline</b> button. This deletes the dropped timeline and allows you to split once more. <br><br>This ability to split and merge is free and unlimited, but be careful: once deleted, a timeline cannot be restored - you must live with the consequences of what you've chosen.<br>        <br>In this level, your goal is to increase your money to 11000 in just 7 days! Make good choices, take advantage of the timeline mechanic to exploit the stock market for all it's worth, and you might just succeed in this impossible task.<br> <br>Good luck!",
    "initial_money": 10000,
    "stocks": [
        {
            "id": 0,
            "name": "StableCorp",
            "price": 200,
            "volatility": 0.5,
            "trend": 1,
            "change_in_trend": 0,
            "number_of_historical_prices": 22
        },
        {
            "id": 1,
            "name": "Speculator Spectacles",
            "price": 150,
            "volatility": 4,
            "trend": -0.2,
            "change_in_trend": 0.05,
            "number_of_historical_prices": 22
        }
    ],
    "loan": "None",
    "timestep": "Day",
    "timelimit": 7,
    "win_cond_type": "money",
    "win_cond": 11000,
    "win_message": "Congratulations, you are now the proud owner of more money than you started with!",
    "lose_message": "Unfortunately, it seems that you fell a bit short from your target goal. Perhaps you'd like to try again? You can of course just move on to the next scenario instead."
 }
 